app/channels/room_channel.rb

  def receive(data)
    user = User.find_by(email: data['email'])

    if message = Message.create(content: data['message'], user_id: user.id)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "kasumiuchan827827827@gmail.com"], ["LIMIT", 1]]
INSERT INTO "messages" ("user_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["content", "a"], ["created_at", "2021-11-19 12:55:52.409889"], ["updated_at", "2021-11-19 12:55:52.409889"]]