app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "message_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["message_id", 1], ["created_at", "2021-11-11 07:45:13.441969"], ["updated_at", "2021-11-11 07:45:13.441969"]]
---
    def create
        like = Like.new(message_id: params[:id], user_id: current_user.id)

        if like.save

SELECT "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
---
      def destroy
        like = Like.find(params[:id])

        if like.destroy