app/controllers/messages_controller.rb

    def index
        messages = Message.includes(:user, [likes: :user])
        messages_array = messages.map do |message|
          {
            id: message.id,
            user_id: message.user.id,
            name: message.user.name,
            content: message.content,
            email: message.user.email,
            created_at: message.created_at,
            likes: message.likes.map { |like| { id: like.id, email: like.user.email }  }
---
SELECT "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "u-chan827@i.softbank.jp"], ["LIMIT", 1]]
SELECT "messages".* FROM "messages"
SELECT "likes".* FROM "likes" WHERE "likes"."message_id" = ?  [["message_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]